The structural type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public StructuralType StructuralType { get; }
  Visual Basic
Public ReadOnly Property StructuralType As StructuralType
	Get
  Visual C++
public:
property StructuralType StructuralType {
	StructuralType get ();
}
 See Also
  ElementStructuralTypeFilter Class
  Autodesk.Revit.DB Namespace